#Область ТестыAPI

// ИсполняемыеСценарии
// 	Сервисный метод для получения списка тестовых методов
// Параметры:
// 	ДополнительныеПараметры - Структура - Дополнительные параметры, используемые при формировании списка тестов
// Возвращаемое значение:
// 	Массив - Имена методов тестов
Функция ИсполняемыеСценарии(ДополнительныеПараметры = Неопределено) Экспорт

	ИсполняемыеСценарии = Новый Массив;
	ИсполняемыеСценарии.Добавить("ПервыйТест");
	ИсполняемыеСценарии.Добавить("ВторойТест");

	Возврат ИсполняемыеСценарии;

КонецФункции

#КонецОбласти

#Область Тесты
// @unit-test: smoke
Процедура ПервыйТест() Экспорт
КонецПроцедуры

// @unit-test: function
Функция ВторойТест() Экспорт
    Возврат Истина;
КонецФункции

// @unit-test: not exported
Процедура Служебный()
КонецПроцедуры
#КонецОбласти
