Процедура Комментарии()
	Вызов(Арг)
	; // комментарий после токена
	Другой()
	); // закрывающая скобка
	Если А = Б
		И Б = В Тогда
		Сообщить("готово");
	КонецЕсли;
	С = А + // оператор перед комментарием
		Б;
	С2 = А + // ещё один оператор перед комментарием
		В;
	Если А = Б И // комм
		Б = В Тогда
		Сообщить("и с комментарием");
	КонецЕсли;
	Если А = Б Или // комм
		Б = В Тогда
		Сообщить("или с комментарием");
	КонецЕсли;
	Вызов(Арг)
	; // И
	Б = В;
	Вызов(Арг)
	); // и
	В = Г;
КонецПроцедуры
